bench/results/rust-axum/20260509-084849/read-c50.txt
Running 30s test @ http://host.containers.internal:3001
  8 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.08ms    2.10ms  78.21ms   93.40%
    Req/Sec   819.53     88.60     1.43k    68.04%
  196084 requests in 30.08s, 26.37MB read
  Non-2xx or 3xx responses: 196084
Requests/sec:   6517.74
Transfer/sec:      0.88MB