bench/results/rust-axum/20260509-084849/read-c500.txt
Running 30s test @ http://host.containers.internal:3001
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.39ms    7.32ms 126.08ms   74.84%
    Req/Sec   788.37    341.33     1.79k    66.38%
  188668 requests in 30.07s, 25.37MB read
  Non-2xx or 3xx responses: 188668
Requests/sec:   6273.52
Transfer/sec:    863.83KB